app/controllers/editor_controller.rb

  def index
    docid = params[:docid]
    search = params[:search]
     logger.info("search="+search.to_s)

    logger.info("docid="+docid.to_s)
    if (docid)
      begin
        @doc = Doc.find(docid);
---
SELECT * FROM `docs` WHERE (`docs`.`id` = 5)

  def create
    logger.info("user id:"+current_user[:id].to_s)
    doc = Doc.new({
      :uid=>current_user[:id],
      :title=>"",
      :doctype=>1,
      :prop=>'',
      :tags=>''
      })
      doc.save!()
---
INSERT INTO `docs` (`doctype`, `created_at`, `title`, `updated_at`, `uid`, `tags`, `prop`) VALUES(1, '2010-03-16 02:24:17', '', '2010-03-16 02:24:17', 1, '', '')

    def del
      id = params[:docid].strip
      # User.new({:name=>"ddd"}).save()
      logger.info("id=>"+id)

	  if (current_user[:id] != Doc.find(id)[:uid] )
			redirect_to :action=>'list'
			return
	  end
      Doc.delete(id)
---
SELECT * FROM `docs` WHERE (`docs`.`id` = 5)
DELETE FROM `docs` WHERE (`id` IN ('5'))